Chequi10/hagie_gui/stm32/stm32_worker.cpp
#include "stm32_worker.h"

#include <chrono>
#include <exception>
#include <iostream>
#include <utility>


STM32Worker::STM32Worker(
    HagieState *state,
    const std::string& port,
    uint32_t baudrate)
    : state(state),
      port(port),
      baudrate(baudrate),
      stm32(nullptr),
      running(false)
{
}


STM32Worker::~STM32Worker()
{
    stop();
}


// ============================================================
// START / STOP
// ============================================================

bool STM32Worker::start()
{
    if (running)
    {
        return true;
    }


    try
    {
        stm32 =
            std::make_unique<
                stm32canbus_serialif
            >(
                port,
                baudrate
            );


        configureCallbacks();


        stm32->start();


        running = true;


        workerThread =
            std::thread(
                &STM32Worker::workerLoop,
                this
            );


        /*
         * La interfaz fue creada correctamente.
         *
         * El estado real de comunicación seguirá
         * siendo actualizado por STM32.
         */
        notifyConnectionState(
            true
        );


        return true;
    }
    catch (const std::exception& e)
    {
        std::cerr
            << "STM32Worker start error: "
            << e.what()
            << std::endl;


        stm32.reset();


        running = false;


        if (state != nullptr)
        {
            HagieState::SystemState system =
                state->getSystemState();


            system.stm32_connected =
                false;


            state->setSystemState(
                system
            );
        }


        notifyConnectionState(
            false
        );


        return false;
    }
}


void STM32Worker::stop()
{
    if (!running)
    {
        if (stm32)
        {
            stm32->stop();

            stm32.reset();
        }


        notifyConnectionState(
            false
        );


        return;
    }


    running = false;


    /*
     * Primero intentar dejar el sistema seguro.
     */
    if (stm32)
    {
        try
        {
            stm32->stop_all_valves();
        }
        catch (...)
        {
        }
    }


    if (workerThread.joinable())
    {
        workerThread.join();
    }


    if (stm32)
    {
        stm32->stop();

        stm32.reset();
    }


    if (state != nullptr)
    {
        HagieState::SystemState system =
            state->getSystemState();


        system.stm32_connected =
            false;


        state->setSystemState(
            system
        );
    }


    notifyConnectionState(
        false
    );
}


bool STM32Worker::isRunning() const
{
    return running;
}


// ============================================================
// CALLBACK DE CONEXIÓN
// ============================================================

void STM32Worker::setConnectionCallback(
    connection_callback callback)
{
    onConnection =
        std::move(callback);
}


void STM32Worker::notifyConnectionState(
    bool connected)
{
    /*
     * ========================================================
     * PÉRDIDA DE STM32
     * ========================================================
     *
     * Nunca conservar órdenes de movimiento pendientes.
     */
    if (!connected)
    {
        {
            std::lock_guard<std::mutex> lock(
                txMutex
            );

            txQueue.clear();
        }

        /*
         * La representación local también queda
         * inmediatamente en MANUAL.
         */
        if (state != nullptr)
        {
            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyAutoMode(
                    body,
                    false
                );

                state->setBodyValveCommand(
                    body,
                    0
                );
            }
        }
    }


    /*
     * Avisar a MainWindow.
     *
     * Este callback puede ejecutarse desde el
     * hilo STM32. MainWindow lo pasará al hilo Qt.
     */
    if (onConnection)
    {
        onConnection(
            connected
        );
    }
}


// ============================================================
// COLA TX
// ============================================================

void STM32Worker::enqueueCommand(
    const Command& command)
{
    std::lock_guard<std::mutex> lock(
        txMutex
    );


    txQueue.push_back(
        command
    );
}


void STM32Worker::processTxQueue()
{
    if (!stm32)
    {
        return;
    }


    while (true)
    {
        Command command;


        {
            std::lock_guard<std::mutex> lock(
                txMutex
            );


            if (txQueue.empty())
            {
                break;
            }


            command =
                txQueue.front();


            txQueue.pop_front();
        }


        switch (command.type)
        {
            case CommandType::SET_TARGET_HEIGHT:
            {
                


                stm32->set_target_height(
                    command.body,
                    static_cast<uint16_t>(
                        command.value
                    )
                );


                break;
            }


            case CommandType::SET_VALVE_COMMAND:
            {
                stm32->set_valve_command(
                    command.body,
                    command.value
                );


                break;
            }


            case CommandType::STOP_ALL_VALVES:
            {
                stm32->stop_all_valves();


                break;
            }


            case CommandType::CLEAR_BODY_FAULT:
            {
                stm32->clear_body_fault(
                    command.body
                );


                break;
            }


            case CommandType::SET_BODY_LIMITS:
            {
                stm32->set_body_limits(
                    command.body,
                    command.value_u16_1,
                    command.value_u16_2
                );


                break;
            }


            case CommandType::SET_MOVE_COMMAND_THRESHOLD:
            {
                stm32->set_move_command_threshold(
                    command.value_u16_1
                );


                break;
            }


            case CommandType::SET_MIN_BODY_MOVEMENT:
            {
                stm32->set_min_body_movement(
                    command.value_float
                );


                break;
            }


