Chequi10/hagie_gui/stm32/stm32_worker.cpp
            case CommandType::SET_NO_MOVEMENT_TIMEOUT:
            {
                stm32->set_no_movement_timeout(
                    command.value_u32
                );


                break;
            }


            case CommandType::SET_TARGET_TIMEOUT:
            {
                stm32->set_target_timeout(
                    command.value_u32
                );


                break;
            }


            case CommandType::SET_ENCODER_DIRECTION:
            {
                stm32->set_encoder_direction(
                    command.body,
                    static_cast<uint8_t>(
                        command.value
                    )
                );


                break;
            }


            case CommandType::SET_ENCODER_SCALE:
            {
                stm32->set_encoder_scale(
                    command.body,
                    command.value_float
                );


                break;
            }
    
            case CommandType::SET_HYDRAULIC_MANAGEMENT_MODE:
            {
                stm32->set_hydraulic_management_mode(
                    static_cast<uint8_t>(
                        command.value
                    )
                );

                break;
            }


            case CommandType::SET_HYDRAULIC_HIGH_COMMAND_THRESHOLD:
            {
                stm32->set_hydraulic_high_command_threshold(
                    command.value_u16_1
                );

                break;
            }


            case CommandType::SET_HYDRAULIC_MAX_HIGH_DEMAND_BODIES:
            {
                stm32->set_hydraulic_max_high_demand_bodies(
                    static_cast<uint8_t>(
                        command.value
                    )
                );

                break;
            }


            case CommandType::SET_HYDRAULIC_SECONDARY_PERCENT:
            {
                stm32->set_hydraulic_secondary_percent(
                    static_cast<uint8_t>(
                        command.value
                    )
                );

                break;
            }

            case CommandType::SET_HEIGHT_CONTROL_KP:
            {
                stm32->set_height_control_kp(
                    command.value_float
                );

                break;
            }


            case CommandType::SET_HEIGHT_CONTROL_KI:
            {
                stm32->set_height_control_ki(
                    command.value_float
                );

                break;
            }


            case CommandType::SET_HEIGHT_CONTROL_KD:
            {
                stm32->set_height_control_kd(
                    command.value_float
                );

                break;
            }


            case CommandType::SET_HEIGHT_CONTROL_DEADBAND:
            {
                stm32->set_height_control_deadband(
                    command.value_float
                );

                break;
            }
        }
    }
}


// ============================================================
// COMANDOS HACIA STM32
// ============================================================

void STM32Worker::setTargetHeight(
    uint8_t body,
    uint16_t height_mm)
{
    if (!running)
    {
        return;
    }

    
    enqueueCommand(
        {
            CommandType::SET_TARGET_HEIGHT,
            body,
            static_cast<int16_t>(
                height_mm
            )
        }
    );


    if (state != nullptr &&
        body < HagieState::BODY_COUNT)
    {
        state->setBodyTarget(
            body,
            height_mm
        );


        state->setBodyAutoMode(
            body,
            true
        );
    }
}


void STM32Worker::setValveCommand(
    uint8_t body,
    int16_t command)
{
    if (!running)
    {
        return;
    }


    enqueueCommand(
        {
            CommandType::SET_VALVE_COMMAND,
            body,
            command
        }
    );


    if (state != nullptr &&
        body < HagieState::BODY_COUNT)
    {
        state->setBodyAutoMode(
            body,
            false
        );
    }
}


void STM32Worker::stopAllValves()
{
    if (!running)
    {
        return;
    }


    enqueueCommand(
        {
            CommandType::STOP_ALL_VALVES,
            0,
            0
        }
    );


    if (state != nullptr)
    {
        for (std::size_t body = 0;
             body < HagieState::BODY_COUNT;
             ++body)
        {
            state->setBodyAutoMode(
                body,
                false
            );
        }
    }
}


void STM32Worker::clearBodyFault(
    uint8_t body)
{
    if (!running)
    {
        return;
    }


    enqueueCommand(
        {
            CommandType::CLEAR_BODY_FAULT,
            body,
            0
        }
    );
}


// ============================================================
// CONFIGURACIÓN RUNTIME
// ============================================================

void STM32Worker::setBodyLimits(
    uint8_t body,
    uint16_t min_height_mm,
    uint16_t max_height_mm)
{
    if (body >=
        HagieState::BODY_COUNT)
    {
        return;
    }


    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.min_height_mm[body] =
        min_height_mm;


    runtimeConfig.max_height_mm[body] =
        max_height_mm;


    runtimeConfig.valid =
        true;
}


void STM32Worker::setMoveCommandThreshold(
    uint16_t threshold)
{
    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.move_command_threshold =
        threshold;


    runtimeConfig.valid =
        true;
}


void STM32Worker::setMinBodyMovement(
    float movement_mm)
{
    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.min_body_movement_mm =
        movement_mm;


    runtimeConfig.valid =
        true;
}


void STM32Worker::setNoMovementTimeout(
    uint32_t timeout_ms)
{
    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.no_movement_timeout_ms =
        timeout_ms;


    runtimeConfig.valid =
        true;
}


void STM32Worker::setTargetTimeout(
    uint32_t timeout_ms)
{
    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.target_timeout_ms =
        timeout_ms;


    runtimeConfig.valid =
        true;
}


