Chequi10/hagie_gui/stm32/stm32_worker.cpp
void STM32Worker::setEncoderDirection(
    uint8_t body,
    uint8_t direction)
{
    if (body >=
        HagieState::BODY_COUNT)
    {
        return;
    }


    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.encoder_direction[body] =
        direction;


    runtimeConfig.valid =
        true;
}


void STM32Worker::setEncoderScale(
    uint8_t body,
    float mm_per_pulse)
{
    if (body >=
        HagieState::BODY_COUNT)
    {
        return;
    }


    std::lock_guard<std::mutex> lock(
        configMutex
    );


    runtimeConfig.encoder_scale[body] =
        mm_per_pulse;


    runtimeConfig.valid =
        true;
}

void STM32Worker::setEncoderMaximum(
    uint8_t body,
    uint32_t maximum_count)
{
    if (body >=
        HagieState::BODY_COUNT)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.encoder_maximum[body] =
        maximum_count;

    runtimeConfig.valid =
        true;
}

void STM32Worker::setEncoderCalibration(
    uint8_t body,
    const int32_t *positions,
    const uint16_t *heights_mm,
    uint8_t point_count)
{
    if (body >= HagieState::BODY_COUNT ||
        point_count >
            MAX_ENCODER_CALIBRATION_POINTS)
    {
        return;
    }

    if (point_count > 0 &&
        (positions == nullptr ||
         heights_mm == nullptr))
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    /*
     * Invalidar temporalmente la tabla mientras
     * se reemplazan sus puntos.
     */
    runtimeConfig
        .encoder_calibration_count[body] =
        0;

    for (std::size_t point = 0;
         point <
            MAX_ENCODER_CALIBRATION_POINTS;
         ++point)
    {
        runtimeConfig
            .encoder_calibration_position
                [body][point] =
            0;

        runtimeConfig
            .encoder_calibration_height_mm
                [body][point] =
            0;
    }

    for (uint8_t point = 0;
         point < point_count;
         ++point)
    {
        runtimeConfig
            .encoder_calibration_position
                [body][point] =
            positions[point];

        runtimeConfig
            .encoder_calibration_height_mm
                [body][point] =
            heights_mm[point];
    }

    runtimeConfig
        .encoder_calibration_count[body] =
        point_count;

    runtimeConfig.valid =
        true;
}

void STM32Worker::setHydraulicManagementMode(
    uint8_t mode)
{
    if (mode > 1)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.hydraulic_management_mode =
        mode;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHydraulicHighCommandThreshold(
    uint16_t threshold)
{
    if (threshold == 0 ||
        threshold > 1000)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.hydraulic_high_command_threshold =
        threshold;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHydraulicMaxHighDemandBodies(
    uint8_t max_bodies)
{
    if (max_bodies == 0 ||
        max_bodies >
            HagieState::BODY_COUNT)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.hydraulic_max_high_demand_bodies =
        max_bodies;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHydraulicSecondaryPercent(
    uint8_t percent)
{
    if (percent > 100)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.hydraulic_secondary_percent =
        percent;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHeightControlKp(
    float kp)
{
    if (kp < 0.0f ||
        kp > 100.0f)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.height_control_kp =
        kp;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHeightControlKi(
    float ki)
{
    if (ki < 0.0f ||
        ki > 100.0f)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.height_control_ki =
        ki;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHeightControlKd(
    float kd)
{
    if (kd < 0.0f ||
        kd > 100.0f)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.height_control_kd =
        kd;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHeightControlDeadband(
    float deadband_mm)
{
    if (deadband_mm < 0.0f ||
        deadband_mm > 500.0f)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig.height_control_deadband_mm =
        deadband_mm;

    runtimeConfig.valid =
        true;
}

void STM32Worker::setHeightUpCompensationPercent(
    uint8_t body,
    int8_t percent)
{
    if (body >= HagieState::BODY_COUNT)
    {
        return;
    }

    if (percent < -20 ||
        percent > 20)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig
        .height_up_compensation_percent[body] =
        percent;

    runtimeConfig.valid =
        true;
}


void STM32Worker::setHeightDownCompensationPercent(
    uint8_t body,
    int8_t percent)
{
    if (body >= HagieState::BODY_COUNT)
    {
        return;
    }

    if (percent < -20 ||
        percent > 20)
    {
        return;
    }

    std::lock_guard<std::mutex> lock(
        configMutex
    );

    runtimeConfig
        .height_down_compensation_percent[body] =
        percent;

    runtimeConfig.valid =
        true;
}


// ============================================================
// SINCRONIZACIÓN CONFIGURACIÓN
// ============================================================

void STM32Worker::enqueueRuntimeConfiguration()
{
    {
        std::lock_guard<std::mutex> lock(
            configMutex
        );


        if (!runtimeConfig.valid)
        {
            return;
        }
    }


