Chequi10/hagie_gui/stm32/stm32_worker.cpp
    beginConfigurationSync();
}


void STM32Worker::beginConfigurationSync()
{
    {
        std::lock_guard<std::mutex> lock(
            configAckMutex
        );


        configAckLimits.fill(
            false
        );


        configAckDirection.fill(
            false
        );


        configAckScale.fill(
            false
        );


        configAckMoveThreshold =
            false;


        configAckMinMovement =
            false;


        configAckNoMovementTimeout =
            false;


        configAckTargetTimeout =
            false;


        configSyncStatus =
            ConfigSyncStatus::PENDING;
    }


    configSyncStep =
        0;


    configCommandPending =
        false;


    configRetryCount =
        0;


    sendCurrentConfigurationCommand();
}


STM32Worker::ConfigSyncStatus
STM32Worker::getConfigSyncStatus() const
{
    std::lock_guard<std::mutex> lock(
        configAckMutex
    );


    return configSyncStatus;
}


void STM32Worker::sendCurrentConfigurationCommand()
{
    RuntimeConfiguration configCopy;


    {
        std::lock_guard<std::mutex> lock(
            configMutex
        );


        if (!runtimeConfig.valid)
        {
            std::lock_guard<std::mutex> ackLock(
                configAckMutex
            );


            configSyncStatus =
                ConfigSyncStatus::ERROR;


            return;
        }


        configCopy =
            runtimeConfig;
    }


    if (!stm32)
    {
        return;
    }


    if (configSyncStep >=
        CONFIG_SYNC_COMMAND_COUNT)
    {
        std::lock_guard<std::mutex> lock(
            configAckMutex
        );


        configSyncStatus =
            ConfigSyncStatus::SYNCHRONIZED;


        configCommandPending =
            false;


        return;
    }


    /*
     * 0..5 -> K01
     */
    if (configSyncStep <= 5)
    {
        uint8_t body =
            configSyncStep;


        stm32->set_body_limits(
            body,
            configCopy.min_height_mm[body],
            configCopy.max_height_mm[body]
        );
    }


    /*
     * 6 -> K02
     */
    else if (configSyncStep == 6)
    {
        stm32->set_move_command_threshold(
            configCopy.move_command_threshold
        );
    }


    /*
     * 7 -> K03
     */
    else if (configSyncStep == 7)
    {
        stm32->set_min_body_movement(
            configCopy.min_body_movement_mm
        );
    }


    /*
     * 8 -> K04
     */
    else if (configSyncStep == 8)
    {
        stm32->set_no_movement_timeout(
            configCopy.no_movement_timeout_ms
        );
    }


    /*
     * 9 -> K05
     */
    else if (configSyncStep == 9)
    {
        stm32->set_target_timeout(
            configCopy.target_timeout_ms
        );
    }


    /*
     * 10..15 -> K06
     */
    else if (configSyncStep <= 15)
    {
        uint8_t body =
            configSyncStep - 10;


        stm32->set_encoder_direction(
            body,
            configCopy.encoder_direction[body]
        );
    }


       /*
     * 16..21 -> K07
     */
    else if (configSyncStep <= 21)
    {
        uint8_t body =
            configSyncStep - 16;

        stm32->set_encoder_scale(
            body,
            configCopy.encoder_scale[body]
        );
    }


    /*
     * 22 -> K10
     */
    else if (configSyncStep == 22)
    {
        stm32->set_hydraulic_management_mode(
            configCopy.hydraulic_management_mode
        );
    }


    /*
     * 23 -> K11
     */
    else if (configSyncStep == 23)
    {
        stm32->set_hydraulic_high_command_threshold(
            configCopy.hydraulic_high_command_threshold
        );
    }


    /*
     * 24 -> K12
     */
    else if (configSyncStep == 24)
    {
        stm32->set_hydraulic_max_high_demand_bodies(
            configCopy.hydraulic_max_high_demand_bodies
        );
    }


    /*
     * 25 -> K13
     */
    else if (configSyncStep == 25)
    {
        stm32->set_hydraulic_secondary_percent(
            configCopy.hydraulic_secondary_percent
        );
    }

    else if (configSyncStep == 26)
    {
        stm32->set_height_control_kp(
            configCopy.height_control_kp
        );
    }


    else if (configSyncStep == 27)
    {
        stm32->set_height_control_ki(
            configCopy.height_control_ki
        );
    }


    else if (configSyncStep == 28)
    {
        stm32->set_height_control_kd(
            configCopy.height_control_kd
        );
    }


    else if (configSyncStep == 29)
    {
        stm32->set_height_control_deadband(
            configCopy.height_control_deadband_mm
        );
    }

        /*
     * 30..35 -> K18
     * Compensación hidráulica SUBIDA
     */
    else if (configSyncStep <= 35)
    {
        uint8_t body =
            configSyncStep - 30;

        stm32->set_height_up_compensation_percent(
            body,
            configCopy
                .height_up_compensation_percent[body]
        );
    }


    /*
     * 36..41 -> K19
     * Compensación hidráulica BAJADA
     * 42..47  -> K08 máximo encoder cuerpos 0..5
    */
    else if (configSyncStep <= 41)
    {
        uint8_t body =
            configSyncStep - 36;

        stm32->set_height_down_compensation_percent(
            body,
            configCopy
                .height_down_compensation_percent[body]
        );
    }

    /*
    * 42..47 -> K08
    * Máximo relativo del encoder.
    */
    else if (configSyncStep <= 47)
    {
        uint8_t body =
            configSyncStep - 42;

        stm32->set_encoder_maximum(
            body,
            configCopy.encoder_maximum[body]
        );
    }

        /*
     * 48..53 -> K09
     * Tabla de calibración del encoder.
     */
    else if (configSyncStep <= 53)
    {
        const uint8_t body =
            configSyncStep - 48;

        stm32->set_encoder_calibration(
            body,
            configCopy
                .encoder_calibration_position[body]
                .data(),
            configCopy
                .encoder_calibration_height_mm[body]
                .data(),
            configCopy
                .encoder_calibration_count[body]
        );
    }


    configCommandPending =
        true;


