Chequi10/hagie_gui/stm32/stm32_worker.cpp
    configCommandSentTime =
        std::chrono::steady_clock::now();
}


void STM32Worker::processConfigurationSync()
{
    if (!configCommandPending)
    {
        return;
    }


    auto now =
        std::chrono::steady_clock::now();


    auto elapsed =
        std::chrono::duration_cast<
            std::chrono::milliseconds
        >(
            now -
            configCommandSentTime
        ).count();


    if (elapsed < 250)
    {
        return;
    }


    /*
     * Timeout esperando ACK.
     */
    if (configRetryCount < 3)
    {
        configRetryCount++;


        configCommandPending =
            false;


        sendCurrentConfigurationCommand();


        return;
    }


    /*
     * Demasiados intentos.
     */
    {
        std::lock_guard<std::mutex> lock(
            configAckMutex
        );


        configSyncStatus =
            ConfigSyncStatus::ERROR;
    }


    configCommandPending =
        false;
}


// ============================================================
// CALLBACKS RX
// ============================================================

void STM32Worker::configureCallbacks()
{
    if (!stm32)
    {
        return;
    }


    // --------------------------------------------------------
    // ENCODERS
    // --------------------------------------------------------

    stm32->set_encoder_callback(
        [this](
            const stm32canbus_serialif::encoder_state&
                encoderState)
        {
            if (state == nullptr)
            {
                return;
            }


            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyHeight(
                    body,
                    encoderState.height_mm[body]
                );
            }
        }
    );

        // --------------------------------------------------------
    // ENCODERS - POSICIÓN BRUTA
    // --------------------------------------------------------

    stm32->set_encoder_raw_callback(
        [this](
            const stm32canbus_serialif::encoder_raw_state&
                encoderRawState)
        {
            if (state == nullptr)
            {
                return;
            }

            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyEncoderRawCount(
                    body,
                    encoderRawState.position[body]
                );
            }
        }
    );

        // --------------------------------------------------------
    // ENCODERS - POSICIÓN RELATIVA AL HOMING
    // --------------------------------------------------------

    stm32->set_encoder_relative_callback(
        [this](
            const stm32canbus_serialif::encoder_relative_state&
                encoderRelativeState)
        {
            if (state == nullptr)
            {
                return;
            }

            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyEncoderRelativeCount(
                    body,
                    encoderRelativeState.position[body]
                );
            }
        }
    );


        // --------------------------------------------------------
    // SENSORES DE LÍMITE
    // --------------------------------------------------------

    stm32->set_limit_sensor_callback(
        [this](
            const stm32canbus_serialif::limit_sensor_state&
                limitState)
        {
            if (state == nullptr)
            {
                return;
            }

            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyLowerLimitActive(
                    body,
                    limitState.lower[body]
                );

                state->setBodyUpperLimitActive(
                    body,
                    limitState.upper[body]
                );
                state->setBodyEncoderReferenced(
                    body,
                    limitState.referenced[body]
                );
            }
        }
    );


    // --------------------------------------------------------
    // VÁLVULAS
    // --------------------------------------------------------

    stm32->set_valve_callback(
        [this](
            const stm32canbus_serialif::valve_state&
                valveState)
        {
            if (state == nullptr)
            {
                return;
            }


            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyValveCommand(
                    body,
                    valveState.command[body]
                );
            }
        }
    );


    // --------------------------------------------------------
    // DIAGNÓSTICO
    // --------------------------------------------------------

    stm32->set_diagnostic_callback(
        [this](
            const stm32canbus_serialif::diagnostic_state&
                diagnostic)
        {
            if (state == nullptr)
            {
                return;
            }


            HagieState::SystemState system =
                state->getSystemState();


            system.stm32_connected =
                diagnostic.jetson_connection_ok;


            system.can_ok =
                (
                    (
                        diagnostic.system_faults
                        & 0x10U
                    ) == 0
                );


            system.system_faults =
                diagnostic.system_faults;


            system.axiomatic_modules =
                diagnostic.axiomatic_modules;

            system.axiomatic_rx_dropped =
                diagnostic.axiomatic_rx_dropped;

            system.uart_error_count =
                diagnostic.uart_error_count;

            system.jetson_tx_queue_dropped =
                diagnostic.jetson_tx_queue_dropped;


            state->setSystemState(
                system
            );


