Chequi10/hagie_gui/stm32/stm32_worker.cpp
            for (std::size_t body = 0;
                 body < HagieState::BODY_COUNT;
                 ++body)
            {
                state->setBodyFaults(
                    body,
                    diagnostic.body_faults[body]
                );
            }
        }
    );


    // --------------------------------------------------------
    // ESTADO GENERAL STM32
    // --------------------------------------------------------

    stm32->set_stm32_state_callback(
        [this](
            const stm32canbus_serialif::stm32_state&
                stm32State)
        {
            if (state == nullptr)
            {
                return;
            }


            HagieState::SystemState system =
                state->getSystemState();


            system.stm32_connected =
                stm32State.jetson_connection_ok;


            system.stm32_uptime_ticks =
                stm32State.uptime_ticks;


            system.axiomatic_modules =
                stm32State.axiomatic_modules;


            state->setSystemState(
                system
            );
        }
    );


    // --------------------------------------------------------
    // IMU
    // --------------------------------------------------------

    stm32->set_imu_callback(
        [this](
            const stm32canbus_serialif::imu_state& imu)
        {
            if (state == nullptr)
            {
                return;
            }


            HagieState::ImuState imuState;


            imuState.valid =
                imu.valid;


            imuState.roll_deg =
                imu.roll_deg;


            imuState.pitch_deg =
                imu.pitch_deg;


            imuState.gravity_deg =
                imu.gravity_deg;


            imuState.gyro_roll_dps =
                imu.gyro_roll_dps;


            imuState.gyro_pitch_dps =
                imu.gyro_pitch_dps;


            imuState.gyro_yaw_dps =
                imu.gyro_yaw_dps;


            imuState.accel_x_mps2 =
                imu.accel_x_mps2;


            imuState.accel_y_mps2 =
                imu.accel_y_mps2;


            imuState.accel_z_mps2 =
                imu.accel_z_mps2;


            state->setImuState(
                imuState
            );


            HagieState::SystemState system =
                state->getSystemState();


            system.imu_valid =
                imu.valid;


            state->setSystemState(
                system
            );
        }
    );


    // --------------------------------------------------------
    // ACK CONFIGURACIÓN
    // --------------------------------------------------------

    stm32->set_config_ack_callback(
        [this](
            const stm32canbus_serialif::config_ack& ack)
        {
            std::cout
                << "CONFIG ACK"
                << " K="
                << static_cast<int>(
                    ack.subcommand
                )
                << " body="
                << static_cast<int>(
                    ack.body
                )
                << " status="
                << static_cast<int>(
                    ack.status
                )
                << " value1="
                << ack.value1
                << " value2="
                << ack.value2
                << std::endl;


            RuntimeConfiguration expected;


            {
                std::lock_guard<std::mutex> lock(
                    configMutex
                );


                expected =
                    runtimeConfig;
            }


            bool validAck =
                false;


            /*
             * STM32 rechazó el parámetro.
             */
            if (ack.status != 0)
            {
                std::lock_guard<std::mutex> lock(
                    configAckMutex
                );


                configSyncStatus =
                    ConfigSyncStatus::ERROR;


                configCommandPending =
                    false;


                return;
            }


            switch (configSyncStep)
            {
                case 0:
                case 1:
                case 2:
                case 3:
                case 4:
                case 5:
                {
                    uint8_t body =
                        configSyncStep;


                    if (
                        ack.subcommand == 0x01 &&
                        ack.body == body &&
                        ack.value1 ==
                            expected
                                .min_height_mm[body] &&
                        ack.value2 ==
                            expected
                                .max_height_mm[body]
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }


                case 6:
                {
                    if (
                        ack.subcommand == 0x02 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .move_command_threshold
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }


                case 7:
                {
                    uint32_t expectedValue =
                        static_cast<uint32_t>(
                            expected
                                .min_body_movement_mm
                            * 100.0f
                            + 0.5f
                        );


                    if (
                        ack.subcommand == 0x03 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expectedValue
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }


                case 8:
                {
                    if (
                        ack.subcommand == 0x04 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .no_movement_timeout_ms
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }


                case 9:
                {
                    if (
                        ack.subcommand == 0x05 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .target_timeout_ms
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }


                case 10:
                case 11:
                case 12:
                case 13:
                case 14:
                case 15:
                {
                    uint8_t body =
                        configSyncStep - 10;


                    if (
                        ack.subcommand == 0x06 &&
                        ack.body == body &&
                        ack.value1 ==
                            expected
                                .encoder_direction[body]
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }


