Chequi10/hagie_gui/stm32/stm32_worker.cpp
                case 16:
                case 17:
                case 18:
                case 19:
                case 20:
                case 21:
                {
                    uint8_t body =
                        configSyncStep - 16;


                    uint32_t expectedValue =
                        static_cast<uint32_t>(
                            expected
                                .encoder_scale[body]
                            * 100000.0f
                            + 0.5f
                        );


                    if (
                        ack.subcommand == 0x07 &&
                        ack.body == body &&
                        ack.value1 ==
                            expectedValue
                    )
                    {
                        validAck =
                            true;
                    }


                    break;
                }

                                case 22:
                {
                    if (
                        ack.subcommand == 0x10 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .hydraulic_management_mode
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                case 23:
                {
                    if (
                        ack.subcommand == 0x11 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .hydraulic_high_command_threshold
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                case 24:
                {
                    if (
                        ack.subcommand == 0x12 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .hydraulic_max_high_demand_bodies
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                case 25:
                {
                    if (
                        ack.subcommand == 0x13 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expected
                                .hydraulic_secondary_percent
                    )
                    {
                        validAck = true;
                    }

                    break;
                }

                                case 26:
                {
                    uint32_t expectedValue =
                        static_cast<uint32_t>(
                            expected
                                .height_control_kp
                            * 100.0f
                            + 0.5f
                        );

                    if (
                        ack.subcommand == 0x14 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expectedValue
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                case 27:
                {
                    uint32_t expectedValue =
                        static_cast<uint32_t>(
                            expected
                                .height_control_ki
                            * 100.0f
                            + 0.5f
                        );

                    if (
                        ack.subcommand == 0x15 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expectedValue
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                case 28:
                {
                    uint32_t expectedValue =
                        static_cast<uint32_t>(
                            expected
                                .height_control_kd
                            * 100.0f
                            + 0.5f
                        );

                    if (
                        ack.subcommand == 0x16 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expectedValue
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                case 29:
                {
                    uint32_t expectedValue =
                        static_cast<uint32_t>(
                            expected
                                .height_control_deadband_mm
                            * 100.0f
                            + 0.5f
                        );

                    if (
                        ack.subcommand == 0x17 &&
                        ack.body == 0xFF &&
                        ack.value1 ==
                            expectedValue
                    )
                    {
                        validAck = true;
                    }

                    break;
                }

                                /*
                 * 30..35 -> ACK K18
                 * Compensación hidráulica SUBIDA
                 */
                case 30:
                case 31:
                case 32:
                case 33:
                case 34:
                case 35:
                {
                    uint8_t body =
                        configSyncStep - 30;

                    uint32_t expectedValue =
                        static_cast<uint8_t>(
                            expected
                                .height_up_compensation_percent[body]
                        );

                    if (
                        ack.subcommand == 0x18 &&
                        ack.body == body &&
                        ack.value1 == expectedValue
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


