Chequi10/hagie_gui/stm32/stm32_worker.cpp
                /*
                 * 36..41 -> ACK K19
                 * Compensación hidráulica BAJADA
                 */
                case 36:
                case 37:
                case 38:
                case 39:
                case 40:
                case 41:
                {
                    uint8_t body =
                        configSyncStep - 36;

                    uint32_t expectedValue =
                        static_cast<uint8_t>(
                            expected
                                .height_down_compensation_percent[body]
                        );

                    if (
                        ack.subcommand == 0x19 &&
                        ack.body == body &&
                        ack.value1 == expectedValue
                    )
                    {
                        validAck = true;
                    }

                    break;
                }

                /*
                * 42..47 -> ACK K08
                * Máximo relativo del encoder.
                */
                case 42:
                case 43:
                case 44:
                case 45:
                case 46:
                case 47:
                {
                    uint8_t body =
                        configSyncStep - 42;

                    uint32_t expectedValid =
                        expected.encoder_maximum[body] > 0
                            ? 1U
                            : 0U;

                    if (
                        ack.subcommand == 0x08 &&
                        ack.body == body &&
                        ack.value1 ==
                            expected.encoder_maximum[body] &&
                        ack.value2 == expectedValid
                    )
                    {
                        validAck = true;
                    }

                    break;
                }

                                /*
                 * 48..53 -> ACK K09
                 * Tabla de calibración del encoder.
                 */
                case 48:
                case 49:
                case 50:
                case 51:
                case 52:
                case 53:
                {
                    const uint8_t body =
                        configSyncStep - 48;

                    if (
                        ack.subcommand == 0x09 &&
                        ack.body == body &&
                        ack.value1 ==
                            expected
                                .encoder_calibration_count[body]
                    )
                    {
                        validAck = true;
                    }

                    break;
                }


                default:
                {
                    return;
                }
            }


            /*
             * ACK incorrecto.
             */
            if (!validAck)
            {
                std::lock_guard<std::mutex> lock(
                    configAckMutex
                );


                configSyncStatus =
                    ConfigSyncStatus::ERROR;


                configCommandPending =
                    false;


                return;
            }


            /*
             * ACK correcto.
             */
            configCommandPending =
                false;


            configRetryCount =
                0;


            configSyncStep++;


            /*
             * Fin de los 22 comandos.
             */
            if (
                configSyncStep >=
                CONFIG_SYNC_COMMAND_COUNT
            )
            {
                std::lock_guard<std::mutex> lock(
                    configAckMutex
                );


                configSyncStatus =
                    ConfigSyncStatus::SYNCHRONIZED;


                return;
            }


            /*
             * Siguiente comando.
             */
            sendCurrentConfigurationCommand();
        }
    );
}


// ============================================================
// HILO STM32
// ============================================================

void STM32Worker::workerLoop()
{
    using namespace std::chrono;


    auto lastHeartbeat =
        steady_clock::now();


    while (running)
    {
        /*
         * ====================================================
         * Si no tenemos interfaz, intentar reconectar.
         * ====================================================
         */
        if (!stm32)
        {
            try
            {
                std::cout
                    << "Intentando reconectar STM32..."
                    << std::endl;


                stm32 =
                    std::make_unique<
                        stm32canbus_serialif
                    >(
                        port,
                        baudrate
                    );


                configureCallbacks();


                stm32->start();


                lastHeartbeat =
                    steady_clock::now();


                /*
                 * =================================================
                 * SEGURIDAD DE RECONEXIÓN
                 * =================================================
                 *
                 * Antes de:
                 *
                 * - avisar a GUI
                 * - sincronizar configuración
                 * - aceptar nuevas consignas
                 *
                 * mandar PARADA TOTAL directamente.
                 *
                 * De esta manera una STM32 que vuelve
                 * a aparecer nunca retoma un AUTO anterior.
                 */
                stm32->stop_all_valves();


                /*
                 * También reflejar localmente MANUAL.
                 */
                if (state != nullptr)
                {
                    for (std::size_t body = 0;
                         body < HagieState::BODY_COUNT;
                         ++body)
                    {
                        state->setBodyAutoMode(
                            body,
                            false
                        );

                        state->setBodyValveCommand(
                            body,
                            0
                        );
                    }
                }


