Chequi10/hagie_gui/stm32/stm32_worker.cpp
                /*
                 * Ahora sí informar que volvió.
                 */
                notifyConnectionState(
                    true
                );


                /*
                 * Reenviar configuración runtime.
                 */
                enqueueRuntimeConfiguration();


                std::cout
                    << "STM32 reconectada."
                    << std::endl;
            }
            catch (const std::exception& e)
            {
                std::cerr
                    << "STM32 aun no disponible: "
                    << e.what()
                    << std::endl;


                /*
                 * Si la interfaz llegó a crearse,
                 * cerrarla antes de destruirla.
                 */
                if (stm32)
                {
                    try
                    {
                        stm32->stop();
                    }
                    catch (...)
                    {
                    }
                }


                stm32.reset();


                notifyConnectionState(
                    false
                );


                std::this_thread::sleep_for(
                    seconds(1)
                );


                continue;
            }
        }


        /*
         * ====================================================
         * Comunicación normal
         * ====================================================
         */

        auto now =
            steady_clock::now();


        auto elapsed =
            duration_cast<
                milliseconds
            >(
                now -
                lastHeartbeat
            );


        /*
         * ----------------------------------------------------
         * HEARTBEAT
         * ----------------------------------------------------
         */
        if (elapsed.count() >= 100)
        {
            try
            {
                stm32->send_heartbeat();


                lastHeartbeat =
                    now;
            }
            catch (const std::exception& e)
            {
                std::cerr
                    << "STM32 desconectada durante heartbeat: "
                    << e.what()
                    << std::endl;


                /*
                 * Estado global.
                 */
                if (state != nullptr)
                {
                    HagieState::SystemState system =
                        state->getSystemState();


                    system.stm32_connected =
                        false;


                    system.can_ok =
                        false;


                    system.imu_valid =
                        false;


                    state->setSystemState(
                        system
                    );
                }


                /*
                 * Cancela AUTO y elimina órdenes
                 * pendientes antes de reconectar.
                 */
                notifyConnectionState(
                    false
                );


                /*
                 * Cerrar interfaz dañada.
                 */
                try
                {
                    stm32->stop();
                }
                catch (...)
                {
                }


                stm32.reset();


                std::this_thread::sleep_for(
                    seconds(1)
                );


                continue;
            }
        }


        /*
         * ----------------------------------------------------
         * COLA TX
         * ----------------------------------------------------
         */
        try
        {
            processTxQueue();


            processConfigurationSync();
        }
        catch (const std::exception& e)
        {
            std::cerr
                << "Error TX STM32: "
                << e.what()
                << std::endl;


            /*
             * Estado global.
             */
            if (state != nullptr)
            {
                HagieState::SystemState system =
                    state->getSystemState();


                system.stm32_connected =
                    false;


                system.can_ok =
                    false;


                system.imu_valid =
                    false;


                state->setSystemState(
                    system
                );
            }


            /*
             * Cancela AUTO y vacía la cola.
             */
            notifyConnectionState(
                false
            );


            /*
             * Cerrar interfaz.
             */
            try
            {
                stm32->stop();
            }
            catch (...)
            {
            }


            stm32.reset();


            std::this_thread::sleep_for(
                seconds(1)
            );


            continue;
        }


        /*
         * Ciclo aproximadamente 100 Hz.
         */
        std::this_thread::sleep_for(
            milliseconds(10)
        );
    }
}